---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileLoadingFamily
source: html/af673ac1-6ac0-bfd1-6aa0-0a026498f734.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileLoadingFamily Property

While loading family '[Family Name]': [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId WhileLoadingFamily { get; }
```